android.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2025-01-14 Tue 12:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org48d20c7">1. remote control</a></li>
<li><a href="#orgc4a3782">2. launcher</a></li>
<li><a href="#orgc408b9c">3. Virtual Linux</a>
<ul>
<li><a href="#org5f47db1">3.1. Termux - a terminal emulator</a></li>
</ul>
</li>
<li><a href="#org378fac9">4. keyboard</a></li>
<li><a href="#org3a22c6b">5. tools</a></li>
<li><a href="#orgb8cbc73">6. IDEs</a></li>
<li><a href="#org113151f">7. Tensorflow Lite</a>
<ul>
<li><a href="#org3ba579e">7.1. requirements</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
;-<b>- mode: Org; fill-column: 110;-</b>-
</p>

<p>
Gentoo <a href="https://wiki.gentoo.org/wiki/Android">https://wiki.gentoo.org/wiki/Android</a>
</p>

<p>
Since Android 5.0 (API 21) - each Android app runs in its own process and with its own instance of the Android
Runtime (ART) — an app runtime environment used by Android OS. ART performs the translation of the app’s
bytecode into native instructions that are later executed by the device’s runtime environment.
</p>

<div id="outline-container-org48d20c7" class="outline-2">
<h2 id="org48d20c7"><span class="section-number-2">1.</span> remote control</h2>
<div class="outline-text-2" id="text-1">
<p>
Scrcpy
</p>
<ul class="org-ul">
<li><a href="https://github.com/Genymobile/scrcpy">https://github.com/Genymobile/scrcpy</a></li>
<li>Apache-2.0 license -</li>
<li><a href="https://packages.gentoo.org/packages/app-mobilephone/scrcpy">https://packages.gentoo.org/packages/app-mobilephone/scrcpy</a></li>
<li>require adb</li>
<li>adb can connect to a device over TCP/IP
<ul class="org-ul">
<li>scrcpy &#x2013;tcpip=192.168.1.1       # default port is 5555</li>
<li>scrcpy &#x2013;tcpip=192.168.1.1:5555</li>
<li>scrcpy &#x2013;tcpipIt - will automatically find the device IP address, enable TCP/IP mode, then connect to the
device before starting.</li>
</ul></li>
<li>scrcpy &#x2013;no-power-on - Silently</li>
</ul>

<p>
Features:
</p>
<ul class="org-ul">
<li>Android device as a webcam (V4L2) (Linux-only)</li>
<li>copy-paste in both directions</li>
<li>mirroring with Android device screen off</li>
</ul>

<p>
android RAT
</p>
</div>
</div>

<div id="outline-container-orgc4a3782" class="outline-2">
<h2 id="orgc4a3782"><span class="section-number-2">2.</span> launcher</h2>
<div class="outline-text-2" id="text-2">
<p>
GPLv3+ <a href="https://github.com/Neamar/KISS">https://github.com/Neamar/KISS</a>
</p>
</div>
</div>
<div id="outline-container-orgc408b9c" class="outline-2">
<h2 id="orgc408b9c"><span class="section-number-2">3.</span> Virtual Linux</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org5f47db1" class="outline-3">
<h3 id="org5f47db1"><span class="section-number-3">3.1.</span> Termux - a terminal emulator</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>fdroid</li>
<li>GPLv3</li>
<li><a href="https://github.com/termux/termux-app">https://github.com/termux/termux-app</a></li>
<li><a href="https://github.com/termux/termux-packages">https://github.com/termux/termux-packages</a></li>
<li>difference from linux:
<ul class="org-ul">
<li>Termux does not follow Filesystem Hierarchy Standard</li>
<li>all programs must be patched and recompiled to meet requirements of the Termux environment</li>
<li>Termux is single-user</li>
</ul></li>
</ul>

<p>
install:
</p>
<ul class="org-ul">
<li>apt update &amp;&amp; apt upgrade</li>
<li>pkg install git wget curl php openssl</li>
</ul>

<p>
videos
<a href="https://noobhacktube.com/">https://noobhacktube.com/</a>
</p>

<p>
Kali Linux inside of Termux <a href="https://github.com/noob-hackers/kalimux">https://github.com/noob-hackers/kalimux</a>
</p>
</div>
</div>
</div>
<div id="outline-container-org378fac9" class="outline-2">
<h2 id="org378fac9"><span class="section-number-2">4.</span> keyboard</h2>
<div class="outline-text-2" id="text-4">
<ul class="org-ul">
<li>unexpected keyboard</li>
</ul>
</div>
</div>
<div id="outline-container-org3a22c6b" class="outline-2">
<h2 id="org3a22c6b"><span class="section-number-2">5.</span> tools</h2>
<div class="outline-text-2" id="text-5">
<p>
We use only native mobile development tools
(Java, Kotlin, Objective-C, Swift)
</p>
</div>
</div>
<div id="outline-container-orgb8cbc73" class="outline-2">
<h2 id="orgb8cbc73"><span class="section-number-2">6.</span> IDEs</h2>
<div class="outline-text-2" id="text-6">
<ul class="org-ul">
<li><p>
Android Studio:  IDE + Android SDK + Android Emulator. <a href="https://en.wikipedia.org/wiki/Android_Studio">https://en.wikipedia.org/wiki/Android_Studio</a>
</p>
<ul class="org-ul">
<li>Binaries: Freeware,[3] Source code:[4][5] Apache License (However, it ships with some SDK updates that are</li>
</ul>
<p>
under a non-free License through its AUR packager. Making it propietary.)
</p>
<ul class="org-ul">
<li>SDK Platform Tools - part of Android SDK <a href="https://developer.android.com/tools/releases/platform-tools">https://developer.android.com/tools/releases/platform-tools</a>
<ul class="org-ul">
<li>primarily: adb and fastboot</li>
</ul></li>
<li>Android cmdline-tools <a href="https://developer.android.com/studio#command-tools">https://developer.android.com/studio#command-tools</a>
<ul class="org-ul">
<li>Alternative (opensource): Unoffical CMake-based build system for tools: adb or fastboot&#x2026; (no  sdkamanager )<a href="https://packages.gentoo.org/packages/dev-util/android-tools">https://packages.gentoo.org/packages/dev-util/android-tools</a>
<ul class="org-ul">
<li>source: <a href="https://github.com/nmeum/android-tools/">https://github.com/nmeum/android-tools/</a></li>
</ul></li>
</ul></li>
</ul></li>
<li><p>
The Android NDK: toolset that lets you implement parts of your app in native code, using languages such as C and C++
</p>

<p>
sdkamanager used to install "platform SDK"
</p></li>
</ul>
</div>
</div>
<div id="outline-container-org113151f" class="outline-2">
<h2 id="org113151f"><span class="section-number-2">7.</span> Tensorflow Lite</h2>
<div class="outline-text-2" id="text-7">
<p>
The TensorFlow Lite Converter is designed to analyze model structure and apply optimizations in order to make
 it compatible with the directly supported operators
</p>

<p>
convert TensorFlow model to TensorFlow Lite format.
</p>
<ul class="org-ul">
<li>supports a limited number of TensorFlow operations used in common inference models,</li>
<li>converter tool allows you to include additional operators - BUT can limit your ability use standard runtime
deployment options, such as Google Play services.</li>
<li>Most TensorFlow Lite operations target both floating-point (float32) and quantized (uint8, int8) inference</li>
</ul>
</div>
<div id="outline-container-org3ba579e" class="outline-3">
<h3 id="org3ba579e"><span class="section-number-3">7.1.</span> requirements</h3>
<div class="outline-text-3" id="text-7-1">
<p>
iOS: TensorFlow Lite offers native iOS libraries written in Swift and Objective-C.
</p>

<p>
Android:
</p>
<ul class="org-ul">
<li>Android Studio 4.2 or higher</li>
<li>Android SDK version 21 or higher</li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2025-01-14 Tue 12:27</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
